MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA2A1AB3CNF/mcu.h
            struct
            {
                __IOM uint8_t PFER : 1; /*!< [0..0] Preface Error Flag                                                 */
                __IOM uint8_t SYER : 1; /*!< [1..1] SYNC Error Flag                                                    */
                __IOM uint8_t SBER : 1; /*!< [2..2] Start Bit Error Flag                                               */
                uint8_t            : 5;
            } MESR_b;
        };
    };

    union
    {
        union
        {
            __IOM uint8_t PCR;            /*!< (@ 0x00000025) Port Control Register                                      */

            struct
            {
                __IOM uint8_t TXDXPS : 1; /*!< [0..0] TXDXn Signal Polarity Select                                       */
                __IOM uint8_t RXDXPS : 1; /*!< [1..1] RXDXn Signal Polarity Select                                       */
                uint8_t              : 2;
                __IOM uint8_t SHARPS : 1; /*!< [4..4] TXDXn/RXDXn Pin Multiplexing Select                                */
                uint8_t              : 3;
            } PCR_b;
        };

        union
        {
            __IOM uint8_t MECR;           /*!< (@ 0x00000025) Manchester Extended Error Control Register                 */

            struct
            {
                __IOM uint8_t PFEREN : 1; /*!< [0..0] Preface Error Flag                                                 */
                __IOM uint8_t SYEREN : 1; /*!< [1..1] Receive SYNC Error Enable                                          */
                __IOM uint8_t SBEREN : 1; /*!< [2..2] Start Bit Error Enable                                             */
                uint8_t              : 5;
            } MECR_b;
        };
    };

    union
    {
        __IOM uint8_t ICR;             /*!< (@ 0x00000026) Interrupt Control Register                                 */

        struct
        {
            __IOM uint8_t BFDIE  : 1;  /*!< [0..0] Break Field Low Width Detected Interrupt Enable                    */
            __IOM uint8_t CF0MIE : 1;  /*!< [1..1] Control Field 0 Match Detected Interrupt Enable                    */
            __IOM uint8_t CF1MIE : 1;  /*!< [2..2] Control Field 1 Match Detected Interrupt Enable                    */
            __IOM uint8_t PIBDIE : 1;  /*!< [3..3] Priority Interrupt Bit Detected Interrupt Enable                   */
            __IOM uint8_t BCDIE  : 1;  /*!< [4..4] Bus Collision Detected Interrupt Enable                            */
            __IOM uint8_t AEDIE  : 1;  /*!< [5..5] Valid Edge Detected Interrupt Enable                               */
            uint8_t              : 2;
        } ICR_b;
    };

    union
    {
        __IM uint8_t STR;              /*!< (@ 0x00000027) Status Register                                            */

        struct
        {
            __IM uint8_t BFDF  : 1;    /*!< [0..0] Break Field Low Width Detection Flag                               */
            __IM uint8_t CF0MF : 1;    /*!< [1..1] Control Field 0 Match Flag                                         */
            __IM uint8_t CF1MF : 1;    /*!< [2..2] Control Field 1 Match Flag                                         */
            __IM uint8_t PIBDF : 1;    /*!< [3..3] Priority Interrupt Bit Detection Flag                              */
            __IM uint8_t BCDF  : 1;    /*!< [4..4] Bus Collision Detected Flag                                        */
            __IM uint8_t AEDF  : 1;    /*!< [5..5] Valid Edge Detection Flag                                          */
            uint8_t            : 2;
        } STR_b;
    };

    union
    {
        __IOM uint8_t STCR;            /*!< (@ 0x00000028) Status Clear Register                                      */

        struct
        {
            __IOM uint8_t BFDCL  : 1;  /*!< [0..0] BFDF Clear                                                         */
            __IOM uint8_t CF0MCL : 1;  /*!< [1..1] CF0MF Clear                                                        */
            __IOM uint8_t CF1MCL : 1;  /*!< [2..2] CF1MF Clear                                                        */
            __IOM uint8_t PIBDCL : 1;  /*!< [3..3] PIBDF Clear                                                        */
            __IOM uint8_t BCDCL  : 1;  /*!< [4..4] BCDF Clear                                                         */
            __IOM uint8_t AEDCL  : 1;  /*!< [5..5] AEDF Clear                                                         */
            uint8_t              : 2;
        } STCR_b;
    };
    __IOM uint8_t CF0DR;               /*!< (@ 0x00000029) Control Field 0 Data Register                              */

    union
    {
        __IOM uint8_t CF0CR;           /*!< (@ 0x0000002A) Control Field 0 Compare Enable Register                    */

        struct
        {
            __IOM uint8_t CF0CE0 : 1;  /*!< [0..0] Control Field 0 Bit 0 Compare Enable                               */
            __IOM uint8_t CF0CE1 : 1;  /*!< [1..1] Control Field 1 Bit 0 Compare Enable                               */
            __IOM uint8_t CF0CE2 : 1;  /*!< [2..2] Control Field 2 Bit 0 Compare Enable                               */
            __IOM uint8_t CF0CE3 : 1;  /*!< [3..3] Control Field 3 Bit 0 Compare Enable                               */
            __IOM uint8_t CF0CE4 : 1;  /*!< [4..4] Control Field 4 Bit 0 Compare Enable                               */
            __IOM uint8_t CF0CE5 : 1;  /*!< [5..5] Control Field 5 Bit 0 Compare Enable                               */
            __IOM uint8_t CF0CE6 : 1;  /*!< [6..6] Control Field 6 Bit 0 Compare Enable                               */
            __IOM uint8_t CF0CE7 : 1;  /*!< [7..7] Control Field 7 Bit 0 Compare Enable                               */
        } CF0CR_b;
    };
    __IOM uint8_t CF0RR;               /*!< (@ 0x0000002B) Control Field 0 Receive Data Register                      */
    __IOM uint8_t PCF1DR;              /*!< (@ 0x0000002C) Primary Control Field 1 Data Register                      */
    __IOM uint8_t SCF1DR;              /*!< (@ 0x0000002D) Secondary Control Field 1 Data Register                    */

    union
    {
        __IOM uint8_t CF1CR;           /*!< (@ 0x0000002E) Control Field 1 Compare Enable Register                    */

        struct
        {
            __IOM uint8_t CF1CE0 : 1;  /*!< [0..0] Control Field 1 Bit 0 Compare Enable                               */
            __IOM uint8_t CF1CE1 : 1;  /*!< [1..1] Control Field 1 Bit 1 Compare Enable                               */
            __IOM uint8_t CF1CE2 : 1;  /*!< [2..2] Control Field 1 Bit 2 Compare Enable                               */
            __IOM uint8_t CF1CE3 : 1;  /*!< [3..3] Control Field 1 Bit 3 Compare Enable                               */
            __IOM uint8_t CF1CE4 : 1;  /*!< [4..4] Control Field 1 Bit 4 Compare Enable                               */
            __IOM uint8_t CF1CE5 : 1;  /*!< [5..5] Control Field 1 Bit 5 Compare Enable                               */
            __IOM uint8_t CF1CE6 : 1;  /*!< [6..6] Control Field 1 Bit 6 Compare Enable                               */
            __IOM uint8_t CF1CE7 : 1;  /*!< [7..7] Control Field 1 Bit 7 Compare Enable                               */
        } CF1CR_b;
    };
    __IOM uint8_t CF1RR;               /*!< (@ 0x0000002F) Control Field 1 Receive Data Register                      */

    union
    {
        __IOM uint8_t TCR;             /*!< (@ 0x00000030) Timer Control Register                                     */

        struct
        {
            __IOM uint8_t TCST : 1;    /*!< [0..0] Timer Count Start                                                  */
            uint8_t            : 7;
        } TCR_b;
    };

    union
    {
        __IOM uint8_t TMR;             /*!< (@ 0x00000031) Timer Mode Register                                        */

        struct
        {
            __IOM uint8_t TOMS : 2;    /*!< [1..0] Timer Operating Mode Select                                        */
            uint8_t            : 1;
            __IOM uint8_t TWRC : 1;    /*!< [3..3] Counter Write Control                                              */
            __IOM uint8_t TCSS : 3;    /*!< [6..4] Timer Count Clock Source Select                                    */
            uint8_t            : 1;
        } TMR_b;
    };
    __IOM uint8_t TPRE;                /*!< (@ 0x00000032) Timer Prescaler Register                                   */
    __IOM uint8_t TCNT;                /*!< (@ 0x00000033) Timer Count Register                                       */
    __IM uint16_t RESERVED1[4];

    union
    {
        __IOM uint8_t SCIMSKEN;        /*!< (@ 0x0000003C) SCI5 TXD Output Mask Enable Register                       */

        struct
        {
            __IOM uint8_t MSKEN : 1;   /*!< [0..0] SCI5 TXD Output Mask Enable                                        */
            uint8_t             : 7;
        } SCIMSKEN_b;
    };
    __IM uint8_t  RESERVED2;
    __IM uint16_t RESERVED3;
} R_SCI0_Type;                         /*!< Size = 64 (0x40)                                                          */

/* =========================================================================================================================== */
/* ================                                         R_SDADC0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief R_SDADC0 (R_SDADC0)
 */

typedef struct                          /*!< (@ 0x4009C000) R_SDADC0 Structure                                         */
{
    union
    {
        __IOM uint16_t STC1;            /*!< (@ 0x00000000) Startup Control Register 1                                 */

        struct
        {
            __IOM uint16_t CLKDIV  : 4; /*!< [3..0] SDADC24 Reference Clock Division                                   */
            uint16_t               : 3;
            __IOM uint16_t SDADLPM : 1; /*!< [7..7] A/D conversion operation model select                              */
            __IOM uint16_t VSBIAS  : 4; /*!< [11..8] Reference voltage select                                          */
            uint16_t               : 3;
            __IOM uint16_t VREFSEL : 1; /*!< [15..15] VREF mode select                                                 */
        } STC1_b;
    };
    __IM uint16_t RESERVED;

    union
    {
        __IOM uint8_t STC2;            /*!< (@ 0x00000004) Startup Control Register 2                                 */

        struct
        {
            __IOM uint8_t BGRPON  : 1; /*!< [0..0] BGR part power control                                             */
            __IOM uint8_t ADCPON  : 1; /*!< [1..1] ADREG forced power-down                                            */
            __IOM uint8_t ADFPWDS : 1; /*!< [2..2] ADC reference supply part                                          */
            uint8_t               : 5;
        } STC2_b;
    };
    __IM uint8_t  RESERVED1;
    __IM uint16_t RESERVED2;

    union
    {
        __IOM uint32_t PGAC[5];        /*!< (@ 0x00000008) Input Multiplexer [0..4] Setting Register                  */

        struct
        {
            __IOM uint32_t PGAGC : 5;  /*!< [4..0] Gain selection of a programmable gain instrumentation
                                        *   amplifier ( Gset1, Gset2, Gtotal )                                        */
            __IOM uint32_t PGAOSR : 3; /*!< [7..5] Oversampling ratio select                                          */
            __IOM uint32_t PGAOFS : 5; /*!< [12..8] Offset voltage select                                             */
            uint32_t              : 1;
            __IOM uint32_t PGAPOL : 1; /*!< [14..14] Polarity select                                                  */
            __IOM uint32_t PGASEL : 1; /*!< [15..15] Analog Channel Input Mode Select                                 */
            __IOM uint32_t PGACTM : 5; /*!< [20..16] Coefficient (m) selection of the A/D conversion count
                                        *   (N) in AUTOSCAN                                                           */
            __IOM uint32_t PGACTN : 3; /*!< [23..21] Coefficient (n) selection of the A/D conversion count
                                        *   (N) in AUTOSCAN                                                           */
            __IOM uint32_t PGAAVN : 2; /*!< [25..24] Selection of the number of data to be averaged                   */
            __IOM uint32_t PGAAVE : 2; /*!< [27..26] Selection of averaging processing                                */
            __IOM uint32_t PGAREV : 1; /*!< [28..28] Single-End Input A/D Converted Data Inversion Select             */
            uint32_t              : 1;
            __IOM uint32_t PGACVE : 1; /*!< [30..30] Calibration enable                                               */
            __IOM uint32_t PGAASN : 1; /*!< [31..31] Selection of the mode for specifying the number of
                                        *   A/D conversions in ADSCAN                                                 */
        } PGAC_b[5];
    };

    union
    {
        __IOM uint32_t ADC1;            /*!< (@ 0x0000001C) Sigma-Delta A/D Converter Control Register 1               */

        struct
        {
            __IOM uint32_t SDADSCM : 1; /*!< [0..0] Selection of autoscan mode                                         */
            uint32_t               : 3;
            __IOM uint32_t SDADTMD : 1; /*!< [4..4] Selection of A/D conversion trigger signal                         */
            uint32_t               : 3;
            __IOM uint32_t SDADBMP : 5; /*!< [12..8] A/D conversion control of the signal from input multiplexer       */
            uint32_t               : 3;
            __IOM uint32_t PGADISA : 1; /*!< [16..16] Control of disconnection detection                               */
            __IOM uint32_t PGADISC : 1; /*!< [17..17] Disconnection Detection Assist Setting                           */
            uint32_t               : 2;
            __IOM uint32_t PGASLFT : 1; /*!< [20..20] PGA offset self-diagnosis enable                                 */
            uint32_t               : 11;
        } ADC1_b;
    };

    union
    {
        __IOM uint8_t ADC2;            /*!< (@ 0x00000020) Sigma-Delta A/D Converter Control Register 2               */

        struct
        {
            __IOM uint8_t SDADST : 1;  /*!< [0..0] Control of A/D conversion                                          */
            uint8_t              : 7;
        } ADC2_b;
    };
    __IM uint8_t  RESERVED3;
    __IM uint16_t RESERVED4;

    union
    {
        __IOM uint32_t ADCR;            /*!< (@ 0x00000024) Sigma-delta A/D Converter Conversion Result Register       */

        struct
        {
            __IM uint32_t SDADCRD : 24; /*!< [23..0] The 24-bit A/D conversion result                                  */
            __IM uint32_t SDADCRS : 1;  /*!< [24..24] Status of an A/D conversion result                               */
            __IM uint32_t SDADCRC : 3;  /*!< [27..25] Channel number for an A/D conversion result                      */
            uint32_t              : 4;
        } ADCR_b;
    };

    union
    {
        __IM uint32_t ADAR;             /*!< (@ 0x00000028) Sigma-delta A/D Converter Average Value Register           */

        struct
        {
            __IM uint32_t SDADMVD : 24; /*!< [23..0] The 24-bit A/D average value                                      */
            __IM uint32_t SDADMVS : 1;  /*!< [24..24] Status of an A/D conversion result                               */
            __IM uint32_t SDADMVC : 3;  /*!< [27..25] Channel number for an A/D conversion result                      */
            uint32_t              : 4;
        } ADAR_b;
    };
    __IM uint32_t RESERVED5;

    union
    {
        __IOM uint8_t CLBC;            /*!< (@ 0x00000030) Calibration Control Register                               */

        struct
        {
            __IOM uint8_t CLBMD : 2;   /*!< [1..0] These bits are read as 0. The write value should be 0.             */
            uint8_t             : 6;
        } CLBC_b;
    };
    __IM uint8_t  RESERVED6;
    __IM uint16_t RESERVED7;

    union
    {
        __IOM uint8_t CLBSTR;          /*!< (@ 0x00000034) Calibration Start Control Register                         */

        struct
        {
            __IOM uint8_t CLBST : 1;   /*!< [0..0] Calibration start control                                          */
            uint8_t             : 7;
        } CLBSTR_b;
    };
    __IM uint8_t  RESERVED8;
    __IM uint16_t RESERVED9;
    __IM uint32_t RESERVED10;

    union
    {
        __IM uint8_t CLBSSR;           /*!< (@ 0x0000003C) Calibration Status Register                                */

        struct
        {
            __IM uint8_t CLBSS : 1;    /*!< [0..0] Calibration status                                                 */
            uint8_t            : 7;
        } CLBSSR_b;
    };
    __IM uint8_t  RESERVED11;
    __IM uint16_t RESERVED12;
} R_SDADC0_Type;                       /*!< Size = 64 (0x40)                                                          */

/* =========================================================================================================================== */
/* ================                                          R_SPI0                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Serial Peripheral Interface (R_SPI0)
 */

